Revit 2027 API
BuiltInFailures.AssemblyFailures.CouldNotChangeTypeOfAssembly Property
 Assembly cannot be changed to selected type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouldNotChangeTypeOfAssembly { get; }
Public Shared ReadOnly Property CouldNotChangeTypeOfAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouldNotChangeTypeOfAssembly {
	FailureDefinitionId^ get ();
}
static member CouldNotChangeTypeOfAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace